

def letterFrequency(text):
    freq = {}
    for c in [c.lower() for c in text if c.isalpha()]:
        freq[c] = freq.get(c, 0) + 1

    return freq




example1 = '''
Ամեն ինչ խառնվեց Օբլոնսկիների տանը։ Կինն իմացավ, որ ամուսինը կապված է եղել 
իրենց տան ֆրանսուհի նախկին դաստիարակչուհու հետ, և հայտարարեց, թե չի կարող 
ապրել նրա հետ միևնույն տան մեջ։ Այդ վիճակը շարունակվում էր արդեն երրորդ օրը, 
և տանջալից զգում էին այն թե ամուսինները, թե ընտանիքի բոլոր անդամները, և 
սպասավորները։ Նրանք բոլորը զգում էին, որ միտք չունի իրենց միասին ապրելը և 
որ յուրաքանչյուր պանդոկում պատահմամբ իրար հանդիպած մարդիկ ավելի են կապված 
իրար հետ, քան իրենք, Օբլոնսկիների ընտանիքի անդամներն ու սպասավորները։ Կինը 
դուրս չէր գալիս իր սենյակներից, ամուսինը երրորդ օրն էր, ինչ տանը չէր։ Երեխաները 
վազվզում էին տնով մեկ՝ իրենք իրենց թողնված, անգլուհին գժտվեց տնտեսուհու հետ և 
տոմս գրեց իր ծանոթ բարեկամուհուն, խնդրելով իր համար նոր տեղ գտնել, խոհարարը 
հեռացավ տանից դեռ երեկ, ճաշի ժամանակ, խոհանոցի աշխատող կինն ու կառապանը խնդրում 
էին վերջնահաշիվ։
'''


freq = letterFrequency(example1)
print(freq)

